MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6M5BF3CBM/mcu.h
typedef struct                         /*!< (@ 0x400AC000) R_CEC Structure                                            */
{
    union
    {
        __IOM uint16_t CADR;           /*!< (@ 0x00000000) CEC Local Address Setting Register                         */

        struct
        {
            __IOM uint16_t ADR00 : 1;  /*!< [0..0] Local Address at Address 0 (TV)                                    */
            __IOM uint16_t ADR01 : 1;  /*!< [1..1] Local Address Setting at Address 1 (recording device
                                        *   1)                                                                        */
            __IOM uint16_t ADR02 : 1;  /*!< [2..2] Local Address Setting at Address 2 (recording device
                                        *   2)                                                                        */
            __IOM uint16_t ADR03 : 1;  /*!< [3..3] Local Address Setting at Address 3 (tuner 1)                       */
            __IOM uint16_t ADR04 : 1;  /*!< [4..4] Local Address Setting at Address 4 (playback device 1)             */
            __IOM uint16_t ADR05 : 1;  /*!< [5..5] Local Address Setting at Address 5 (audio system)                  */
            __IOM uint16_t ADR06 : 1;  /*!< [6..6] Local Address Setting at Address 6 (tuner 2)                       */
            __IOM uint16_t ADR07 : 1;  /*!< [7..7] Local Address Setting at Address 7 (tuner 3)                       */
            __IOM uint16_t ADR08 : 1;  /*!< [8..8] Local Address Setting at Address 8 (playback device 2)             */
            __IOM uint16_t ADR09 : 1;  /*!< [9..9] Local Address Setting at Address 9 (recording device
                                        *   3)                                                                        */
            __IOM uint16_t ADR10 : 1;  /*!< [10..10] Local Address Setting at Address 10 (tuner 4)                    */
            __IOM uint16_t ADR11 : 1;  /*!< [11..11] Local Address Setting at Address 11 (playback device
                                        *   3)                                                                        */
            __IOM uint16_t ADR12 : 1;  /*!< [12..12] Local Address Setting at Address 12 (reserved)                   */
            __IOM uint16_t ADR13 : 1;  /*!< [13..13] Local Address Setting at Address 13 (reserved)                   */
            __IOM uint16_t ADR14 : 1;  /*!< [14..14] Local Address Setting at Address 14 (specific use)               */
            uint16_t             : 1;
        } CADR_b;
    };

    union
    {
        __IOM uint8_t CECCTL1;         /*!< (@ 0x00000002) CEC Control Register 1                                     */

        struct
        {
            __IOM uint8_t SFT   : 2;   /*!< [1..0] Signal-Free Time Data Bit Width Select                             */
            __IOM uint8_t CESEL : 2;   /*!< [3..2] Communication Complete Interrupt (INTCE) Generation Timing
                                        *   Select                                                                    */
            __IOM uint8_t STERRD : 1;  /*!< [4..4] Start Bit Error Detection Select                                   */
            __IOM uint8_t BLERRD : 1;  /*!< [5..5] Bus Lock Detection Select                                          */
            __IOM uint8_t CINTMK : 1;  /*!< [6..6] CEC Data Interrupt (INTDA) Generation Select                       */
            __IOM uint8_t CDFC   : 1;  /*!< [7..7] Digital Filter Select                                              */
        } CECCTL1_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint16_t STATB;          /*!< (@ 0x00000004) CEC Transmission Start Bit Width Setting Register          */

        struct
        {
            __IOM uint16_t STATB : 9;  /*!< [8..0] CEC Transmission Start Bit Width Setting                           */
            uint16_t             : 7;
        } STATB_b;
    };

    union
    {
        __IOM uint16_t STATL;          /*!< (@ 0x00000006) CEC Transmission Start Bit Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t STATL : 9;  /*!< [8..0] CEC Transmission Start Bit Low Width Setting                       */
            uint16_t             : 7;
        } STATL_b;
    };

    union
    {
        __IOM uint16_t LGC0L;          /*!< (@ 0x00000008) CEC Transmission Logical 0 Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t LGC0L : 9;  /*!< [8..0] CEC Transmission Logical 0 Low Width Setting                       */
            uint16_t             : 7;
        } LGC0L_b;
    };

    union
    {
        __IOM uint16_t LGC1L;          /*!< (@ 0x0000000A) CEC Transmission Logical 1 Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t LGC1L : 9;  /*!< [8..0] CEC Transmission Logical 1 Low Width Setting                       */
            uint16_t             : 7;
        } LGC1L_b;
    };

    union
    {
        __IOM uint16_t DATB;           /*!< (@ 0x0000000C) CEC Transmission Data Bit Width Setting Register           */

        struct
        {
            __IOM uint16_t DATB : 9;   /*!< [8..0] CEC Transmission Data Bit Width Setting                            */
            uint16_t            : 7;
        } DATB_b;
    };

    union
    {
        __IOM uint16_t NOMT;           /*!< (@ 0x0000000E) CEC Reception Data Sampling Time Setting Register          */

        struct
        {
            __IOM uint16_t NOMT : 9;   /*!< [8..0] CEC Reception Data Sampling Time Setting,                          */
            uint16_t            : 7;
        } NOMT_b;
    };

    union
    {
        __IOM uint16_t STATLL;         /*!< (@ 0x00000010) CEC Reception Start Bit Minimum Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t STATLL : 9; /*!< [8..0] CEC Reception Start Bit Minimum Low Width Setting                  */
            uint16_t              : 7;
        } STATLL_b;
    };

    union
    {
        __IOM uint16_t STATLH;         /*!< (@ 0x00000012) CEC Reception Start Bit Maximum Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t STATLH : 9; /*!< [8..0] CEC Reception Start Bit Maximum Bit Width Setting                  */
            uint16_t              : 7;
        } STATLH_b;
    };

    union
    {
        __IOM uint16_t STATBL;         /*!< (@ 0x00000014) CEC Reception Start Bit Minimum Bit Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t STATBL : 9; /*!< [8..0] CEC Reception Start Bit Minimum Bit Width Setting                  */
            uint16_t              : 7;
        } STATBL_b;
    };

    union
    {
        __IOM uint16_t STATBH;         /*!< (@ 0x00000016) CEC Reception Start Bit Maximum Bit Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t STATBH : 9; /*!< [8..0] CEC Reception Start Bit Maximum Bit Width Setting                  */
            uint16_t              : 7;
        } STATBH_b;
    };

    union
    {
        __IOM uint16_t LGC0LL;         /*!< (@ 0x00000018) CEC Reception Logical 0 Minimum Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t LGC0LL : 9; /*!< [8..0] CEC Reception Logical 0 Minimum Low Width Setting                  */
            uint16_t              : 7;
        } LGC0LL_b;
    };

    union
    {
        __IOM uint16_t LGC0LH;         /*!< (@ 0x0000001A) CEC Reception Logical 0 Maximum Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t LGC0LH : 9; /*!< [8..0] CEC Reception Logical 0 Minimum Low Width Setting                  */
            uint16_t              : 7;
        } LGC0LH_b;
    };

    union
    {
        __IOM uint16_t LGC1LL;         /*!< (@ 0x0000001C) CEC Reception Logical 1 Minimum Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t LGC1LL : 9; /*!< [8..0] CEC Reception Logical 1 Minimum Low Width Setting                  */
            uint16_t              : 7;
        } LGC1LL_b;
    };

    union
    {
        __IOM uint16_t LGC1LH;         /*!< (@ 0x0000001E) CEC Reception Logical 1 Maximum Low Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t LGC1LH : 9; /*!< [8..0] CEC Reception Logical 1 Maximum Low Width Setting                  */
            uint16_t              : 7;
        } LGC1LH_b;
    };

    union
    {
        __IOM uint16_t DATBL;          /*!< (@ 0x00000020) CEC Reception Data Bit Minimum Bit Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t DATBL : 9;  /*!< [8..0] CEC Reception Data Bit Minimum Bit Width Setting                   */
            uint16_t             : 7;
        } DATBL_b;
    };

    union
    {
        __IOM uint16_t DATBH;          /*!< (@ 0x00000022) CEC Reception Data Bit Maximum Bit Width Setting
                                        *                  Register                                                   */

        struct
        {
            __IOM uint16_t DATBH : 9;  /*!< [8..0] CEC Reception Data Bit Maximum Bit Width Setting                   */
            uint16_t             : 7;
        } DATBH_b;
    };

    union
    {
        __IOM uint16_t NOMP;           /*!< (@ 0x00000024) CEC Data Bit Reference Width Setting Register              */

        struct
        {
            __IOM uint16_t NOMP : 9;   /*!< [8..0] CEC Data Bit Reference Width Setting                               */
            uint16_t            : 7;
        } NOMP_b;
    };
    __IM uint16_t RESERVED1;

    union
    {
        __IOM uint8_t CECEXMD;         /*!< (@ 0x00000028) CEC Extension Mode Register                                */

        struct
        {
            uint8_t                  : 4;
            __IOM uint8_t LERPLEN    : 1; /*!< [4..4] Pulse Output Function Enable by Long Bit Width Error               */
            __IOM uint8_t RERCVEN    : 1; /*!< [5..5] Start Detection Reception Restart Enable                           */
            uint8_t                  : 1;
            __IOM uint8_t RCVINTDSEL : 1; /*!< [7..7] INTDA Reception Interrupt Timing Change                            */
        } CECEXMD_b;
    };
    __IM uint8_t RESERVED2;

    union
    {
        __IOM uint8_t CECEXMON;        /*!< (@ 0x0000002A) CEC Extension Monitor Register                             */

        struct
        {
            __IM uint8_t CECLNMON : 1; /*!< [0..0] CEC Line Monitor                                                   */
            __IM uint8_t ACKF     : 1; /*!< [1..1] ACK Flag                                                           */
            uint8_t               : 6;
        } CECEXMON_b;
    };
    __IM uint8_t  RESERVED3;
    __IM uint16_t RESERVED4[10];
    __IOM uint8_t CTXD;                /*!< (@ 0x00000040) CEC Transmission Buffer Register                           */
    __IOM uint8_t CRXD;                /*!< (@ 0x00000041) CEC Reception Buffer Register                              */

    union
    {
        __IOM uint8_t CECES;           /*!< (@ 0x00000042) CEC Communication Error Status Register                    */

        struct
        {
            __IM uint8_t OERR   : 1;   /*!< [0..0] Overrun Error Detection Flag                                       */
            __IM uint8_t UERR   : 1;   /*!< [1..1] Underrun Error Detection Flag                                      */
            __IM uint8_t ACKERR : 1;   /*!< [2..2] ACK Error Detection Flag                                           */
            __IM uint8_t TERR   : 1;   /*!< [3..3] Timing Error Detection Flag                                        */
            __IM uint8_t TXERR  : 1;   /*!< [4..4] Transmission Error Detection Flag                                  */
            __IM uint8_t AERR   : 1;   /*!< [5..5] Arbitration Loss Detection Flag                                    */
            __IM uint8_t BLERR  : 1;   /*!< [6..6] Bus Lock Error Detection Flag                                      */
            uint8_t             : 1;
        } CECES_b;
    };

    union
    {
        __IOM uint8_t CECS;            /*!< (@ 0x00000043) CEC Communication Status Register                          */

        struct
        {
            __IM uint8_t ADRF  : 1;    /*!< [0..0] Address Match Detection Flag                                       */
            __IM uint8_t BUSST : 1;    /*!< [1..1] Bus Busy Detection Flag                                            */
            __IM uint8_t TXST  : 1;    /*!< [2..2] Transmission Status Flag                                           */
            __IM uint8_t EOMF  : 1;    /*!< [3..3] EOM Flag                                                           */
            __IM uint8_t ITCEF : 1;    /*!< [4..4] INTCE Generation Source Flag                                       */
            uint8_t            : 2;
            __IM uint8_t SFTST : 1;    /*!< [7..7] Signal-Free Time Rewrite Disable Report Flag                       */
        } CECS_b;
    };

    union
    {
        __IOM uint8_t CECFC;           /*!< (@ 0x00000044) CEC Communication Error Flag Clear Trigger Register        */

        struct
        {
            __OM uint8_t OCTRG   : 1;  /*!< [0..0] Overrun Error Detection Flag Clear Trigger                         */
            __OM uint8_t UCTRG   : 1;  /*!< [1..1] Underrun Error Detection Flag Clear Trigger                        */
            __OM uint8_t ACKCTRG : 1;  /*!< [2..2] ACK Error Detection Flag Clear Trigger                             */
            __OM uint8_t TCTRG   : 1;  /*!< [3..3] Timing Error Detection Flag Clear Trigger                          */
            __OM uint8_t TXCTRG  : 1;  /*!< [4..4] Transmission Error Detection Flag Clear Trigger                    */
            __OM uint8_t ACTRG   : 1;  /*!< [5..5] Arbitration Loss Detection Flag Clear Trigger                      */
            __OM uint8_t BLCTRG  : 1;  /*!< [6..6] Bus Lock Error Detection Flag Clear Trigger                        */
            uint8_t              : 1;
        } CECFC_b;
    };

    union
    {
        __IOM uint8_t CECCTL0;         /*!< (@ 0x00000045) CEC Control Register 0                                     */

        struct
        {
            __IOM uint8_t EOM     : 1; /*!< [0..0] EOM Setting                                                        */
            __IOM uint8_t CECRXEN : 1; /*!< [1..1] Reception Enable Control                                           */
            __OM uint8_t  TXTRG   : 1; /*!< [2..2] Transmission Start Trigger                                         */
            __IOM uint8_t CCL     : 3; /*!< [5..3] CEC Clock (CECCLK) Select                                          */
            __IOM uint8_t ACKTEN  : 1; /*!< [6..6] ACK Bit Timing Error (Bit Width) Check Enable                      */
            __IOM uint8_t CECE    : 1; /*!< [7..7] CEC Operation Enable Flag                                          */
        } CECCTL0_b;
    };
} R_CEC_Type;                          /*!< Size = 70 (0x46)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_OSPI                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Octa Serial Peripheral Interface (R_OSPI)
 */

