MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6M5BF3CBM/mcu.h
typedef struct                         /*!< (@ 0x400A6000) R_OSPI Structure                                           */
{
    union
    {
        __IOM uint32_t DCR;            /*!< (@ 0x00000000) Device Command Register                                    */

        struct
        {
            __IOM uint32_t DVCMD0 : 8; /*!< [7..0] Device Command data                                                */
            __IOM uint32_t DVCMD1 : 8; /*!< [15..8] Device Command data                                               */
            uint32_t              : 16;
        } DCR_b;
    };

    union
    {
        __IOM uint32_t DAR;            /*!< (@ 0x00000004) Device Address Register                                    */

        struct
        {
            __IOM uint32_t DVAD0 : 8;  /*!< [7..0] Device Address data 0                                              */
            __IOM uint32_t DVAD1 : 8;  /*!< [15..8] Device Address data 1                                             */
            __IOM uint32_t DVAD2 : 8;  /*!< [23..16] Device Address data 2                                            */
            __IOM uint32_t DVAD3 : 8;  /*!< [31..24] Device Address data 3                                            */
        } DAR_b;
    };

    union
    {
        __IOM uint32_t DCSR;           /*!< (@ 0x00000008) Device Command Setting Register                            */

        struct
        {
            __IOM uint32_t DALEN  : 8; /*!< [7..0] Transfer data length setting                                       */
            __IOM uint32_t DMLEN  : 8; /*!< [15..8] Dummy cycle setting                                               */
            uint32_t              : 3;
            __IOM uint32_t ACDV   : 1; /*!< [19..19] Access Device setting                                            */
            __IOM uint32_t CMDLEN : 3; /*!< [22..20] Transfer command length setting                                  */
            __IOM uint32_t DAOR   : 1; /*!< [23..23] Data order setting                                               */
            __IOM uint32_t ADLEN  : 3; /*!< [26..24] Transfer address length setting                                  */
            __IOM uint32_t DOPI   : 1; /*!< [27..27] DOPI single byte setting                                         */
            __IOM uint32_t ACDA   : 1; /*!< [28..28] Data Access Control                                              */
            __IOM uint32_t PREN   : 1; /*!< [29..29] Preamble bit enable for OctaRAM                                  */
            uint32_t              : 2;
        } DCSR_b;
    };

    union
    {
        __IOM uint32_t DSR[2];         /*!< (@ 0x0000000C) Device Size Register 0                                     */

        struct
        {
            __IOM uint32_t DVSZ  : 30; /*!< [29..0] Device size setting                                               */
            __IOM uint32_t DVTYP : 2;  /*!< [31..30] Device type setting                                              */
        } DSR_b[2];
    };

    union
    {
        __IOM uint32_t MDTR;             /*!< (@ 0x00000014) Memory Delay Trim Register                                 */

        struct
        {
            __IOM uint32_t DV0DEL   : 8; /*!< [7..0] Device 0 delay setting                                             */
            __IOM uint32_t DQSERAM  : 4; /*!< [11..8] OM_DQS enable counter                                             */
            __IOM uint32_t DQSESOPI : 4; /*!< [15..12] OM_DQS enable counter                                            */
            __IOM uint32_t DV1DEL   : 8; /*!< [23..16] Device 1 delay setting                                           */
            __IOM uint32_t DQSEDOPI : 4; /*!< [27..24] OM_DQS enable counter                                            */
            uint32_t                : 4;
        } MDTR_b;
    };

    union
    {
        __IOM uint32_t ACTR;           /*!< (@ 0x00000018) Auto-Calibration Timer Register                            */

        struct
        {
            __IOM uint32_t CTP : 32;   /*!< [31..0] Automatic calibration cycle time setting                          */
        } ACTR_b;
    };

    union
    {
        __IOM uint32_t ACAR[2];        /*!< (@ 0x0000001C) Auto-Calibration Address Register                          */

        struct
        {
            __IOM uint32_t CAD : 32;   /*!< [31..0] Automatic calibration address                                     */
        } ACAR_b[2];
    };
    __IM uint32_t RESERVED[4];

    union
    {
        __IOM uint32_t DRCSTR;           /*!< (@ 0x00000034) Device Memory Map Read Chip Select Timing Setting
                                          *                  Register                                                   */

        struct
        {
            __IOM uint32_t CTRW0 : 7;    /*!< [6..0] Device 0 single continuous read waiting cycle setting
                                          *   in PCLKH units                                                            */
            __IOM uint32_t CTR0     : 1; /*!< [7..7] Device 0 single continuous read mode setting                       */
            __IOM uint32_t DVRDCMD0 : 3; /*!< [10..8] Device 0 Command execution interval setting                       */
            __IOM uint32_t DVRDHI0  : 3; /*!< [13..11] Device 0 select signal pull-up timing setting                    */
            __IOM uint32_t DVRDLO0  : 2; /*!< [15..14] Device 0 select signal pull-down timing setting                  */
            __IOM uint32_t CTRW1    : 7; /*!< [22..16] Device 1 single continuous read waiting cycle setting
                                          *   in PCLKH units                                                            */
            __IOM uint32_t CTR1     : 1; /*!< [23..23] Device 1 single continuous read mode setting                     */
            __IOM uint32_t DVRDCMD1 : 3; /*!< [26..24] Device 1 Command execution interval                              */
            __IOM uint32_t DVRDHI1  : 3; /*!< [29..27] Device 1 select signal High timing setting                       */
            __IOM uint32_t DVRDLO1  : 2; /*!< [31..30] Device 1 select signal pull-down timing setting                  */
        } DRCSTR_b;
    };

    union
    {
        __IOM uint32_t DWCSTR;          /*!< (@ 0x00000038) Device Memory Map Write Chip Select Timing Setting
                                         *                  Register                                                   */

        struct
        {
            __IOM uint32_t CTWW0 : 7;   /*!< [6..0] Device 0 single continuous write waiting cycle setting
                                         *   in PCLKH units                                                            */
            __IOM uint32_t CTW0    : 1; /*!< [7..7] Device 0 single continuous write mode setting                      */
            __IOM uint32_t DVWCMD0 : 3; /*!< [10..8] Device 0 Command execution interval setting                       */
            __IOM uint32_t DVWHI0  : 3; /*!< [13..11] Device 0 select signal pull-up timing setting                    */
            __IOM uint32_t DVWLO0  : 2; /*!< [15..14] Device 0 select signal pull-down timing setting                  */
            __IOM uint32_t CTWW1   : 7; /*!< [22..16] Device 1 single continuous write waiting cycle setting
                                         *   in PCLKH units                                                            */
            __IOM uint32_t CTW1    : 1; /*!< [23..23] Device 1 single continuous write mode setting                    */
            __IOM uint32_t DVWCMD1 : 3; /*!< [26..24] Device 1 Command execution interval setting                      */
            __IOM uint32_t DVWHI1  : 3; /*!< [29..27] Device 1 select signal pull-up timing setting                    */
            __IOM uint32_t DVWLO1  : 2; /*!< [31..30] Device 1 select signal pull-down timing setting                  */
        } DWCSTR_b;
    };

    union
    {
        __IOM uint32_t DCSTR;          /*!< (@ 0x0000003C) Device Chip Select Timing Setting Register                 */

        struct
        {
            uint32_t                : 8;
            __IOM uint32_t DVSELCMD : 3; /*!< [10..8] Device Command execution interval setting                         */
            __IOM uint32_t DVSELHI  : 3; /*!< [13..11] Device select signal pull-up timing setting                      */
            __IOM uint32_t DVSELLO  : 2; /*!< [15..14] Device select signal pull-down timing setting                    */
            uint32_t                : 16;
        } DCSTR_b;
    };

    union
    {
        __IOM uint32_t CDSR;            /*!< (@ 0x00000040) Controller and Device Setting Register                     */

        struct
        {
            __IOM uint32_t DV0TTYP : 2; /*!< [1..0] Device0_transfer_type setting                                      */
            __IOM uint32_t DV1TTYP : 2; /*!< [3..2] Device1_transfer_type setting                                      */
            __IOM uint32_t DV0PC   : 1; /*!< [4..4] Device0_memory precycle setting                                    */
            __IOM uint32_t DV1PC   : 1; /*!< [5..5] Device1_memory precycle setting                                    */
            uint32_t               : 4;
            __IOM uint32_t ACMEME0 : 1; /*!< [10..10] Automatic calibration memory enable setting for device
                                         *   0                                                                         */
            __IOM uint32_t ACMEME1 : 1; /*!< [11..11] Automatic calibration memory enable setting for device
                                         *   1                                                                         */
            __IOM uint32_t ACMODE : 2;  /*!< [13..12] Automatic calibration mode                                       */
            uint32_t              : 17;
            __IOM uint32_t DLFT   : 1;  /*!< [31..31] Deadlock Free Timer Enable                                       */
        } CDSR_b;
    };

    union
    {
        __IOM uint32_t MDLR;           /*!< (@ 0x00000044) Memory Map Dummy Length Register                           */

        struct
        {
            __IOM uint32_t DV0RDL : 8; /*!< [7..0] Device 0 Read dummy length setting                                 */
            __IOM uint32_t DV0WDL : 8; /*!< [15..8] Device 0 Write dummy length setting                               */
            __IOM uint32_t DV1RDL : 8; /*!< [23..16] Device 1 Read dummy length setting                               */
            __IOM uint32_t DV1WDL : 8; /*!< [31..24] Device 1 Write dummy length setting                              */
        } MDLR_b;
    };

    union
    {
        __IOM uint32_t MRWCR[2];        /*!< (@ 0x00000048) Memory Map Read/Write Command Register                     */

        struct
        {
            __IOM uint32_t DMRCMD0 : 8; /*!< [7..0] Memory map read command 0 setting                                  */
            __IOM uint32_t DMRCMD1 : 8; /*!< [15..8] Memory map read command 1 setting                                 */
            __IOM uint32_t DMWCMD0 : 8; /*!< [23..16] Memory map write command 0 setting                               */
            __IOM uint32_t DMWCMD1 : 8; /*!< [31..24] Memory map write command 1 setting                               */
        } MRWCR_b[2];
    };

    union
    {
        __IOM uint32_t MRWCSR;         /*!< (@ 0x00000050) Memory Map Read/Write Setting Register                     */

        struct
        {
            __IOM uint32_t MRAL0 : 3;  /*!< [2..0] Device 0 read address length setting                               */
            __IOM uint32_t MRCL0 : 3;  /*!< [5..3] Device 0 read command length setting                               */
            __IOM uint32_t MRO0  : 1;  /*!< [6..6] Device 0 read order setting                                        */
            __IOM uint32_t PREN0 : 1;  /*!< [7..7] Preamble bit enable for mem0 memory-map read                       */
            __IOM uint32_t MWAL0 : 3;  /*!< [10..8] Device 0 write address length setting                             */
            __IOM uint32_t MWCL0 : 3;  /*!< [13..11] Device 0 write command length setting                            */
            __IOM uint32_t MWO0  : 1;  /*!< [14..14] Device 0 write order setting                                     */
            uint32_t             : 1;
            __IOM uint32_t MRAL1 : 3;  /*!< [18..16] Device 1 read address length setting                             */
            __IOM uint32_t MRCL1 : 3;  /*!< [21..19] Device 1 read command length setting                             */
            __IOM uint32_t MRO1  : 1;  /*!< [22..22] Device 1 read order setting                                      */
            __IOM uint32_t PREN1 : 1;  /*!< [23..23] Preamble bit enable for mem1 memory-map read                     */
            __IOM uint32_t MWAL1 : 3;  /*!< [26..24] Device 1 write address length setting                            */
            __IOM uint32_t MWCL1 : 3;  /*!< [29..27] Device 1 write command length setting                            */
            __IOM uint32_t MWO1  : 1;  /*!< [30..30] Device 1 write order setting                                     */
            uint32_t             : 1;
        } MRWCSR_b;
    };

    union
    {
        __IM uint32_t ESR;             /*!< (@ 0x00000054) Error Status Register                                      */

        struct
        {
            __IM uint32_t MRESR : 8;   /*!< [7..0] Memory map read error status                                       */
            __IM uint32_t MWESR : 8;   /*!< [15..8] Memory map write error status                                     */
            uint32_t            : 16;
        } ESR_b;
    };

    union
    {
        __OM uint32_t CWNDR;           /*!< (@ 0x00000058) Configure Write without Data Register                      */

        struct
        {
            __OM uint32_t WND : 32;    /*!< [31..0] The write value should be 0.                                      */
        } CWNDR_b;
    };

    union
    {
        __OM uint32_t CWDR;            /*!< (@ 0x0000005C) Configure Write Data Register                              */

        struct
        {
            __OM uint32_t WD0 : 8;     /*!< [7..0] Write data 0                                                       */
            __OM uint32_t WD1 : 8;     /*!< [15..8] Write data 1                                                      */
            __OM uint32_t WD2 : 8;     /*!< [23..16] Write data 2                                                     */
            __OM uint32_t WD3 : 8;     /*!< [31..24] Write data 3                                                     */
        } CWDR_b;
    };

    union
    {
        __IM uint32_t CRR;             /*!< (@ 0x00000060) Configure Read Register                                    */

        struct
        {
            __IM uint32_t RD0 : 8;     /*!< [7..0] Read data 0                                                        */
            __IM uint32_t RD1 : 8;     /*!< [15..8] Read data 1                                                       */
            __IM uint32_t RD2 : 8;     /*!< [23..16] Read data 2                                                      */
            __IM uint32_t RD3 : 8;     /*!< [31..24] Read data 3                                                      */
        } CRR_b;
    };

    union
    {
        __IOM uint32_t ACSR;           /*!< (@ 0x00000064) Auto-Calibration Status Register                           */

        struct
        {
            __IOM uint32_t ACSR0 : 3;  /*!< [2..0] Auto-calibration status of device 0                                */
            __IOM uint32_t ACSR1 : 3;  /*!< [5..3] Auto-calibration status of device 1                                */
            uint32_t             : 26;
        } ACSR_b;
    };
    __IM uint32_t RESERVED1[5];

    union
    {
        __IOM uint32_t DCSMXR;         /*!< (@ 0x0000007C) Device Chip Select Maximum Period Register                 */

        struct
        {
            __IOM uint32_t CTWMX0 : 9; /*!< [8..0] Indicates the maximum period that OM_CS0 and OM_CS1 are
                                        *   Low in single continuous write of OctaRAM.                                */
            uint32_t              : 7;
            __IOM uint32_t CTWMX1 : 9; /*!< [24..16] Indicates the maximum period that OM_CS0 and OM_CS1
                                        *   are Low in single continuous read of OctaRAM.                             */
            uint32_t : 7;
        } DCSMXR_b;
    };

    union
    {
        __IOM uint32_t DWSCTSR;        /*!< (@ 0x00000080) Device Memory Map Write single continuous translating
                                        *                  size Register                                              */

        struct
        {
            __IOM uint32_t CTSN0 : 11; /*!< [10..0] Indicates the number of bytes to translate in single
                                        *   continuous write of device 0.                                             */
            uint32_t             : 5;
            __IOM uint32_t CTSN1 : 11; /*!< [26..16] Indicates the number of bytes to translate in single
                                        *   continuous write of device 1.                                             */
            uint32_t : 5;
        } DWSCTSR_b;
    };
} R_OSPI_Type;                         /*!< Size = 132 (0x84)                                                         */

/* =========================================================================================================================== */
/* ================                                         R_USB_HS0                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief USB 2.0 High-Speed Module (R_USB_HS0)
 */

typedef struct                         /*!< (@ 0x40111000) R_USB_HS0 Structure                                        */
{
    union
    {
        __IOM uint16_t SYSCFG;         /*!< (@ 0x00000000) System Configuration Control Register                      */

        struct
        {
            __IOM uint16_t USBE  : 1;  /*!< [0..0] USB Operation Enable                                               */
            uint16_t             : 3;
            __IOM uint16_t DPRPU : 1;  /*!< [4..4] D+ Line Resistor Control                                           */
            __IOM uint16_t DRPD  : 1;  /*!< [5..5] D+/D- Line Resistor Control                                        */
            __IOM uint16_t DCFM  : 1;  /*!< [6..6] Controller Function Select                                         */
            __IOM uint16_t HSE   : 1;  /*!< [7..7] High-Speed Operation Enable                                        */
            __IOM uint16_t CNEN  : 1;  /*!< [8..8] Single End Receiver Enable                                         */
            uint16_t             : 7;
        } SYSCFG_b;
    };

    union
    {
        __IOM uint16_t BUSWAIT;        /*!< (@ 0x00000002) CPU Bus Wait Register                                      */

        struct
        {
            __IOM uint16_t BWAIT : 4;  /*!< [3..0] CPU Bus Access Wait Specification BWAIT waits (BWAIT+2
                                        *   access cycles)                                                            */
            uint16_t : 12;
        } BUSWAIT_b;
    };

    union
    {
        __IM uint16_t SYSSTS0;         /*!< (@ 0x00000004) System Configuration Status Register                       */

        struct
        {
            __IM uint16_t LNST  : 2;   /*!< [1..0] USB Data Line Status Monitor                                       */
            __IM uint16_t IDMON : 1;   /*!< [2..2] ID0 Pin Monitor                                                    */
            uint16_t            : 2;
            __IM uint16_t SOFEA : 1;   /*!< [5..5] SOF Active Monitor While Host Controller Function is
                                        *   Selected.                                                                 */
            __IM uint16_t HTACT  : 1;  /*!< [6..6] Host Sequencer Status Monitor                                      */
            uint16_t             : 7;
            __IM uint16_t OVCMON : 2;  /*!< [15..14] External USB1_OVRCURA/USB1_OVRCURB Input Pin MonitorThe
                                        *   OCVMON[1] bit indicates the status of the USBHS_OVRCURA
                                        *   pin. The OCVMON[0] bit indicates the status of the USBHS_OVRCURB
                                        *   pin.                                                                      */
        } SYSSTS0_b;
    };

    union
    {
        __IM uint16_t PLLSTA;          /*!< (@ 0x00000006) PLL Status Register                                        */

        struct
        {
            __IM uint16_t PLLLOCK : 1; /*!< [0..0] PLL Lock Flag                                                      */
            uint16_t              : 15;
        } PLLSTA_b;
    };

    union
    {
        __IOM uint16_t DVSTCTR0;        /*!< (@ 0x00000008) Device State Control Register 0                            */

        struct
        {
            __IM uint16_t RHST    : 3;  /*!< [2..0] USB Bus Reset Status                                               */
            uint16_t              : 1;
            __IOM uint16_t UACT   : 1;  /*!< [4..4] USB Bus Operation Enable for the Host Controller Operation         */
            __IOM uint16_t RESUME : 1;  /*!< [5..5] Resume Signal Output for the Host Controller Operation             */
            __IOM uint16_t USBRST : 1;  /*!< [6..6] USB Bus Reset Output for the Host Controller Operation             */
            __IOM uint16_t RWUPE  : 1;  /*!< [7..7] Remote Wakeup Detection Enable for the Host Controller
                                         *   Operation                                                                 */
            __IOM uint16_t WKUP    : 1; /*!< [8..8] Remote Wakeup Output for the Device Controller Operation           */
            __IOM uint16_t VBUSEN  : 1; /*!< [9..9] USBHS_VBUSEN Output Pin Control                                    */
            __IOM uint16_t EXICEN  : 1; /*!< [10..10] USBHS_EXICEN Output Pin Control                                  */
            __IOM uint16_t HNPBTOA : 1; /*!< [11..11] Host Negotiation Protocol (HNP) Control Use this bit
                                         *   when switching from device B to device A in OTGmode. If
                                         *   the HNPBTOA bit is 1, the internal function controlremains
                                         *   in the Suspend state until the HNP processing endseven
                                         *   if SYSCFG.DPRPU = 0 or SYSCFG.DCFM = 1 is set.                            */
            uint16_t : 4;
        } DVSTCTR0_b;
    };
    __IM uint16_t RESERVED;

    union
    {
        __IOM uint16_t TESTMODE;       /*!< (@ 0x0000000C) USB Test Mode Register                                     */

        struct
        {
            __IOM uint16_t UTST : 4;   /*!< [3..0] Test Mode                                                          */
            uint16_t            : 12;
        } TESTMODE_b;
    };
    __IM uint16_t RESERVED1;
    __IM uint32_t RESERVED2;

    union
    {
        union
        {
            __IOM uint32_t CFIFO;             /*!< (@ 0x00000014) CFIFO Port Register                                        */

